XMLCF/src/DataProcessors/sps_ДлительныеОперации2/sps_ДлительныеОперации2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>sps_ДлительныеОперации2</name>
  <attributes>
    <name>датаН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>датаК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

XMLCF/src/DataProcessors/sps_ДлительныеОперации2/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры  

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
    Элементы.СообщениеФорма.ВыделенныйТекст = "";
	ОбновитьОтображениеДанных();
	ДлительнаяОперация = НачатьПроведениеДокументовРТУ(Объект.датаН,КонецДня(Объект.датаК),Объект.УникальныйИдентификатор);
	
	// 2. Подключение обработчика завершения фонового задания.
	//@skip-check undefined-variable
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Фоновое выполнение длительных операций";
	//ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//РежимОткрытияОкна = БлокироватьВесьИнтерфейс;
	ПараметрыОжидания.Интервал = 2;
  	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Картинка = БиблиотекаКартинок.sps_MyCat; 

	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	//@skip-check undefined-variable
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция НачатьПроведениеДокументовРТУ(ДатаН,ДатаК,УникальныйИдентификатор)
	//"здесь процедура общего модуля где будет выполняться вв ввиде фонового задания"
	//@skip-check undefined-variable
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	//@skip-check undefined-variable
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"sps_ДлительныеОперации.ГрупповоеПроведениеДокументов"
	,"РТУ",ДатаН, ДатаК);
КонецФункции
&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
 КоличествоПерепроведенныхПТ = 0;	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		//@skip-check undefined-variable
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	КоличествоПерепроведенныхПТ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);

	Элементы.СообщениеФорма.ВыделенныйТекст = "Перепроведено " + КоличествоПерепроведенныхПТ + " документов"; 
    ОбновитьОтображениеДанных();
КонецПроцедуры

#КонецОбласти
